templates/collection.xml.erb

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
  <soap12:Body>
    <GrabaServicios  xmlns="http://www.asmred.com/">
      <docIn>
        <Servicios uidcliente="<%= client_uid %>">
          <Recogida codrecogida="">
            <Horarios>
              <Fecha dia="<%= date.strftime("%d/%m/%Y") %>">
                <Horario desde="<%= time_from %>" hasta="<%= time_to %>" />
              </Fecha>
            </Horarios>
            <RecogerEn>
              <Nombre><%= name %></Nombre>
              <Direccion><%= address %></Direccion>
              <Poblacion><%= city %></Poblacion>
              <Provincia><%= state %></Provincia>
              <Pais><%= country_code %></Pais>
              <CP><%= zipcode %></CP>
              <Telefono><%= phone %></Telefono>
              <Movil><%= mobile %></Movil>
              <Email><%= email %></Email>
            </RecogerEn>
            <Referencias>
              <Referencia tipo="C"><%= reference_number %></Referencia>
            </Referencias>
          </Recogida>
        </Servicios>
      </docIn>
    </GrabaServicios>
  </soap12:Body>
</soap12:Envelope>
